<details ><summary>Digger run report at 2024-09-09 00:01:32 (UTC)</summary>
      <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # civo_firewall.core-firewall will be created
  + resource "civo_firewall" "core-firewall" {
      + create_default_rules = false
      + id                   = (known after apply)
      + name                 = "core"
      + network_id           = (known after apply)
      + region               = (known after apply)

      + egress_rule (known after apply)

      + ingress_rule {
          + action     = "allow"
          + cidr       = [
              + "0.0.0.0/0",
            ]
          + id         = (known after apply)
          + label      = "k8s"
          + port_range = "443"
          + protocol   = "tcp"
        }
      + ingress_rule {
          + action     = "allow"
          + cidr       = [
              + "0.0.0.0/0",
            ]
          + id         = (known after apply)
          + label      = "k8s"
          + port_range = "6443"
          + protocol   = "tcp"
        }
      + ingress_rule {
          + action     = "allow"
          + cidr       = [
              + "0.0.0.0/0",
            ]
          + id         = (known after apply)
          + label      = "k8s"
          + port_range = "80"
          + protocol   = "tcp"
        }
    }

  # civo_kubernetes_cluster.core-cluster will be created
  + resource "civo_kubernetes_cluster" "core-cluster" {
      + api_endpoint           = (known after apply)
      + applications           = "cert-manager"
      + cluster_type           = (known after apply)
      + cni                    = (known after apply)
      + created_at             = (known after apply)
      + dns_entry              = (known after apply)
      + firewall_id            = (known after apply)
      + id                     = (known after apply)
      + installed_applications = (known after apply)
      + kubeconfig             = (sensitive value)
      + kubernetes_version     = (known after apply)
      + master_ip              = (known after apply)
      + name                   = "core"
      + network_id             = (known after apply)
      + num_target_nodes       = (known after apply)
      + ready                  = (known after apply)
      + region                 = (known after apply)
      + status                 = (known after apply)
      + target_nodes_size      = (known after apply)
      + write_kubeconfig       = false

      + pools {
          + instance_names      = (known after apply)
          + label               = (known after apply)
          + node_count          = 3
          + public_ip_node_pool = (known after apply)
          + size                = "g4s.kube.small"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details ><summary>Terraform plan validation check (core-cluster)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                RESOURCE                |
|--------|----------------------------------------|
| add    | `civo_firewall.core-firewall`          |
|        | `civo_kubernetes_cluster.core-cluster` |

</details>

</details>